{
  "id": 1,
  "items": [
    {
      "id": 1,
      "name": "Data structures",
      "levels": [
        {
          "name": "pow(2, n)",
          "description": "Doesn’t know the difference between Array and LinkedList",
          "is_checked": false
        },
        {
          "name": "pow(n, 2)",
          "description": "Able to explain and use Arrays, LinkedLists, Dictionaries etc in practical programming tasks",
          "is_checked": false
        },
        {
          "name": "n",
          "description": "Knows space and time tradeoffs of the basic data structures, Arrays vs LinkedLists, Able to explain how hashtables can be implemented and can handle collisions, Priority queues and ways to implement them etc.",
          "is_checked": false
        },
        {
          "name": "log(n)",
          "description": "Knowledge of advanced data structures like B-trees, binomial and fibonacci heaps, AVL/Red Black trees, Splay Trees, Skip Lists, tries etc.",
          "is_checked": false
        }
      ]
    },
    {
      "id": 2,
      "name": "Algorithms",
      "levels": [
        {
          "name": "pow(2, n)",
          "description": "Unable to find the average of numbers in an array (It’s hard to believe but I’ve interviewed such candidates)",
          "is_checked": false
        },
        {
          "name": "pow(n, 2)",
          "description": "Basic sorting, searching and data structure traversal and retrieval algorithms",
          "is_checked": false
        },
        {
          "name": "n",
          "description": "Tree, Graph, simple greedy and divide and conquer algorithms, is able to understand the relevance of the levels of this matrix.",
          "is_checked": false
        },
        {
          "name": "log(n)",
          "description": "Able to recognize and code dynamic programming solutions, good knowledge of graph algorithms, good knowledge of numerical computation algorithms, able to identify NP problems etc.",
          "is_checked": false
        }
      ]
    },
    {
      "id": 2,
      "name": "Systems programming",
      "levels": [
        {
          "name": "pow(2, n)",
          "description": "Doesn’t know what a compiler, linker or interpreter is",
          "is_checked": false
        },
        {
          "name": "pow(n, 2)",
          "description": "Basic understanding of compilers, linker and interpreters. Understands what assembly code is and how things work at the hardware level. Some knowledge of virtual memory and paging.",
          "is_checked": false
        },
        {
          "name": "n",
          "description": "Understands kernel mode vs. user mode, multi-threading, synchronization primitives and how they’re implemented, able to read assembly code. Understands how networks work, understanding of network protocols and socket level programming.",
          "is_checked": false
        },
        {
          "name": "log(n)",
          "description": "Understands the entire programming stack, hardware (CPU + Memory + Cache + Interrupts + microcode), binary code, assembly, static and dynamic linking, compilation, interpretation, JIT compilation, garbage collection, heap, stack, memory addressing…",
          "is_checked": false
        }
      ]
    }
  ]
}
